Revit 2024 API
Mesh.DistributionOfNormals Property
 Indicates the distribution of normal vectors along the tessellated mesh surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public DistributionOfNormals DistributionOfNormals { get; }
Visual Basic
Public ReadOnly Property DistributionOfNormals As DistributionOfNormals
	Get
Visual C++
public:
property DistributionOfNormals DistributionOfNormals {
	DistributionOfNormals get ();
}
See Also
Mesh Class
Autodesk.Revit.DB Namespace